app/serializers/user_serializer.rb

  def resumes
    self.object.resumes.map { |resume| resume.image_url  }
---
SELECT "resumes".* FROM "resumes" WHERE "resumes"."user_id" = $1  [["user_id", 1]]