app/controllers/api/v1/comments_controller.rb

SELECT  "resumes".* FROM "resumes" WHERE "resumes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    if params.include?(:resume_id)
      @resume = Resume.find(params[:resume_id])