app/controllers/api/v1/resumes_controller.rb

SELECT "resumes".* FROM "resumes"
---
  def index
    @resumes = Resume.all

SELECT  "resumes".* FROM "resumes" WHERE "resumes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @resume = Resume.find(params[:id])